#Дан текст, за яким слідує крапка. В алфавітному порядку вивести на екран (по разу)
#усі малі українські голосні букви, що входять в цей текст.
#Гармідер Анастасія 122В
s = ('в четверг я косив люцерку .')
s1 = {'a', 'е', 'и', 'і', 'о', 'у', 'я', 'ю', 'є', 'ї'}
if s[-1] == '.':
    s.replace('.', '')
b = list(s)
s1.intersection_update(b)
print(s)
print(sorted(s1))


