#Задача. Визначити загальну вартість всіх товарів, випущених в поточному році і
#вивести інформацію про ці товари. Поля структури: Найменування, Виробник, Рік
#випуску, Кількість, Ціна.
#Гармідер Анастасія 122В
while True:
    while True:
        try:
            sclad_dict = {}
            n = int(input("скільки товарів добавимо в склад?"))
            break
        except ValueError:
            print('Тільки числа')
            for j in range(1,n+1):
                d = []
                for i in range(1):
                    d = dict(найменування=input('введіть найменування'),виробник =input('введіть виробник'),рік_випуску = int(input('введіть рік випуску')),кількість= int(input('введіть кількість')),ціна= int(input('введіть ціну')))
                sclad_dict[j] = d
            sum = 0
            for i in sclad_dict:
                if sclad_dict[i].get('рік_випуску') == 2020:
                    print(sclad_dict[i])
                    sum += sclad_dict[i].get('ціна')
            print('загальна вартість всіх товарів, випущених у поточному році',sum)
            result = input('Хочете ввести ще раз? Якщо так натисніть 1, якщо ні будь яку іншу клавішу....')
            if result == '1':
                continue
            else:
                 break